#include <cmath>

/*√лобальна€ переменна€ представл€ет собой переменную, чье им€ и значение известны на прот€жении всей программы.
ƒл€ создани€ глобальной переменной вы объ€вл€ете переменную в начале вашего исходного файла вне какой - либо функции.
¬се функции, которые следуют за таким объ€влением, могут использовать эту глобальную переменную.
ќднако, поскольку злоупотребление глобальными переменными может привести к ошибкам, следует избегать их использовани€ 
в ваших программах везде, где это возможно*/

// объ€вление глобальных переменных
extern double x, y, result;

// функци€ без параметров (вычисление)
void operation()
{
	result = ((x - 1) * sqrt(x) - (y - 1) * sqrt(y)) / (sqrt(pow(x, 3)) * y + x * y + pow(x, 2) - x);;
}