# ОПМУ - Лабораторная работа №1

> Вариант 20

* [Цель практикума](#Цель-практикума)
* [Теоретические сведения](#Теоретические-сведения)
* [Задание 1](#Задание-1)

## Цель практикума

Линейное программирование на С++

## Теоретические сведения

*Форматный вывод. Настройка ширины полей*

Для размещения чисел различной длины в полях постоянной ширины
можно воспользоваться функцией-членом width. Может применяться двумя
способами:
cout.width(); cout.width(i);
Первая форма возвращает текущую установку ширины поля. Вторая
устанавливает ширину поля равной i пробелам и возвращает предыдущее
значение ширины. Метод width() касается только следующего отображаемого
элемента, после чего ширина поля возвращается к значению по умолчанию.

Пример:

cout << '#'; cout.width(12);

cout << 12 << "#" << 24 << "#\n";

Оператор вывода создает следующую строку вывода:

`#         12#24#`

*Установка точности отображения чисел с плавающей точкой*

Функция-член precission() позволяет задать количество знаков после
десятичной точки.

cout.precision(n); //n — число знаков после десятичной точки

## Задание 1

Составить программу для вычисления эквивалентных пар выражений
z 1 ,z 2 ,y 1 ,y 2 в соответствии с заданием в таблице. Для всех выражений
подобрать входные данные согласно ОДЗ.
Вывести на экран результаты вычислений и входные данные. Для
вывода данных использовать форматный вывод. Ввод данных организовать с
клавиатуры.

*Source.cpp*

```c++
#include <iostream>
#include <cmath>
#define M_PI 3.14159265358979323846
using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");

	double x, a, z1, z2, y1, y2;

	cout << "Введите значение x: ";
	cin >> x;
	cout << "Введите значение a: ";
	cin >> a;
	cout << endl;

	z1 = (sqrt(1 - pow(x, 2)) + 1) / (1 / sqrt(1 + x) + sqrt(1 - x));
	z2 = sqrt(1 + x);
	y1 = 3 - 4 * pow((sin(3 * M_PI / 2 - a)), 2);
	y2 = 4 * cos(M_PI / 6 + a) * cos(M_PI / 6 - a);

	cout << "z1 = " << z1 << endl;
	cout << "z2 = " << z2 << endl;
	cout << "y1 = " << y1 << endl;
	cout << "y2 = " << y2 << endl;

	system("pause");
}
```
